{
    "https://www.moneycontrol.com/news/business/markets/sebi-probes-insider-trading-at-indusind-bank-report-12977099.html": {
        "Headline": "Sebi probes insider trading at IndusInd Bank: Report",
        "Description": "SEBI is also examining whether IndusInd violated its disclosure norms, the report said",
        "Content": "The Securities and Exchange Board of India (SEBI) is probing a possible insider trading among senior officials of IndusInd Bank amid significant accounting lapses by the lender, the Economic Times reported on March 27. The shares of the bank slipped 0.9 percent to Rs 649.4 on NSE at 09:57 am on Thursday. The Mumbai-based lender reported earlier this month that it had discovered accounting discrepancies in the way it booked currency derivatives, going back at least six years, with an estimated impact of about $175 million. The market regulator has sought information about trades executed by five senior officials while they were in possession of unpublished price-sensitive information of IndusInd, the newspaper said, citing two people close to the development. SEBI is also examining whether IndusInd violated its disclosure norms, the report said. The lender did not immediately respond to a Reuters' request for comment. It has appointed an independent firm to conduct an investigation into the lapses and the discrepancies, which have also led to concerns over governance at the bank. Reuters reported earlier this week that IndusInd had appointed Grant Thornton to conduct the review. Shares of IndusInd have fallen over 27% since it first announced the lapses on March 10. "
    },
    "https://www.moneycontrol.com/news/business/companies/jio-platforms-gets-two-prestigious-intellectual-property-awards-12976936.html": {
        "Headline": "Jio Platforms gets two prestigious intellectual property awards",
        "Description": "Jio Platforms was awarded the National Intellectual Property Awards by the Government of India and also recognized by the World Intellectual Property Organization (WIPO) for its outstanding achievements in technology and innovation at an event in New Delhi.",
        "Content": "Jio Platforms Limited (JPL) has announced on Wednesday that it has secured two major intellectual property awards, while highlighting its key role in strengthening India's technological sovereignty and digital independence. Jio Platforms was awarded the National Intellectual Property Awards by the Government of India and also recognized by the World Intellectual Property Organization (WIPO) for its outstanding achievements in technology and innovation at an event in New Delhi. The awards recognizes JPL's intellectual property achievements and crucial role in advancing India's Aatmanirbhar (self-reliant) vision within the telecommunications sector. JPL's approach to intellectual property supports the Government of India's 'Viksit Bharat 2047' vision, which aims to make India a developed economy through innovation, digital progress, and building homegrown technology. With the Indian government prioritizing the Bharat 6G vision, JPL is leading the way in this technological revolution. While receiving the award, Senior Vice President at Jio Platforms Limited, Aayush Bhatnagar, said, \"These awards validate our approach of combining innovation with a deep commitment to solving real-world challenges. We are not just creating technologies; we are building capabilities that can drive national growth and global competitiveness in the digital era through 5G, 6G and Artificial Intelligence.\" The company’s strong research and development, along with its successful implementation of homegrown 5G and AI technologies, makes it a major player in India’s evolving telecom sector. Its patent portfolio, which includes over 4,000 global applications filed in the last three years, represents a significant advancement in India’s intellectual property landscape. With over 4,000 global patent applications filed in the past three years, \"its patent portfolio signifies a major leap in India’s intellectual property landscape\", the company said in a statement. These patents cover leading sectors in telecommunications, digital technologies, artificial intelligence, and emerging technologies, establishing JPL as a global leader in innovation. Disclaimer: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. "
    },
    "https://www.moneycontrol.com/news/business/companies/delhi-hc-restrains-natco-pharma-from-launching-generic-of-roche-s-rare-disease-drug-12976800.html": {
        "Headline": "Delhi HC restrains Natco Pharma from launching generic of Roche's rare disease drug",
        "Description": "\"Roche has filed an appeal against the Hon. Delhi High Court order and the matter is subjudice in the appeal court,\" Roche Pharma India spokesperson told Moneycontrol.",
        "Content": "A two-judge bench of Delhi High Court on Wednesday refrained Natco Pharma from launching the generic version of Swiss drugmaker Roche Pharma's patented drug Risdiplam until the hearing on April 2. Risdiplam used in treatment of Spinal Muscular Atrophy (SMA), a rare-genetic disease, that causes muscle weakness and atrophy, due to damage to nerve cells in the spinal cord, leading to difficulty with basic functions like walking, breathing, and swallowing. A single judge of Delhi High Court had earlier denied an injunction request from Roche on March 24, in an alleged patent infringement case against Natco Pharma, potentially opening the door for access to a generic of the patented drug Risdiplam at a fraction of the marketed cost. An injunction is an order issued by a court, to a party, requiring them to either perform or abstain from a specific act. Roche has filed an appeal against the Delhi High Court order that allows Natco Pharma to go ahead with the launch of the copycat version, at a fraction of the cost. Roche Pharma India has confirmed the stay on the Natco Pharma's launch. \"Roche has filed an appeal against the Hon. Delhi High Court order and the matter is subjudice in the appeal court,\" Roche Pharma India spokesperson told Moneycontrol. “Roche is committed to protecting its innovation,\" the spokesperson added. Roche Pharma said since the launch of Evrysdi (risdiplam) - the first and still the only approved solution for SMA in 2021 , the company has been actively collaborating with local authorities in India to implement tailored pricing. Roche had moved the court seeking interim injunction for restraining the infringement of the Suit Patent No. IN 334397, arguing that it has a term of 20 years from May 2015 till May 2035. It said there has been no pre-grant or post-grant opposition, or any revocation proceedings filed against the suit patent in India. \"We are also supporting patients through our patient assistance program which makes Evrysdi more affordable. Our commitment to patients in India began well before it was commercially available. In 2020, Roche initiated a Compassionate Use Program (CUP) for SMA patients under which 52 patients across India are benefitting free of cost. Today we have over 270 SMA patients in India who have benefitted from Evrysdi since its launch in India,\" the company said. Natco spokesperson couldn't be reached for the comment. Seba PA and Purva Mittal, two young women battling SMA, had intervened in the case to highlight the urgent need for the court to consider their right to life in the matter, as well as the significant negative impact an injunction could have on access to the drug Risdiplam, given the price disparity between patented drug and its anticipated, low-cost generic. "
    },
    "https://www.moneycontrol.com/news/business/companies/india-s-power-sector-facing-shortage-of-skilled-workforce-12976606.html": {
        "Headline": "India’s power sector facing shortage of skilled workforce?",
        "Description": "The government is actively looking to increase its skilled and professional manpower base to tackle dynamic fields such as cybersecurity and Artifical Intelligence (AI) as the country plans to increase its transmission grid network by 34 percent till 2030, according to senior officials in the Ministry of Power.",
        "Content": "India, the third largest electricity producer in the world, is facing skilled manpower shortage in its expanding power sector which boasts of a unified national grid that is vulnerable to cyberattacks. The government is actively looking to increase its skilled and professional manpower base to tackle dynamic fields such as cybersecurity and Artifical Intelligence (AI) as the country plans to increase its transmission grid network by 34 percent till 2030, according to senior officials in the Ministry of Power. The capacity building is being seen through startups and involvement of reputed Indian institutions, apart from recruitment across its public sector enterprises. AI and Cybersecurity experts “The government’s Smart Meter Mission is one area where discoms and even government companies have to look for skilled professionals. Our target is to install 20 crore smart meters, so you can imagine the data generated through these meters. This data has to be used for the benefit of the consumers, the distribution utilities and also for the grid system operator. We are tying up with startups with expertise in AI for this,” said a senior ministry official. The government is also looking for cybersecurity experts as the power sector is an important pillar in the country’s economic growth and hence, can be a target for cyber attackers who can cause significant disruptions in services and cause physical damage to the infrastructure. Cyberattacks can be in the form of spyware, malware, network hacking of the grid, or any power utility. The lack of experts was highlighted by the Ministry of Power to the Parliamentary standing committee for energy, which later in its report issued this month stated, “With the advancement in technology, Cyber security is increasingly becoming critical to any organization. However, there are not enough qualified individuals to address increasing demand of these professionals.” In 2022, Tata Power, India’s largest power generation company, confirmed that it had been hit by a cyberattack on its information technology (IT) infrastructure, impacting some of its IT systems. No further details of the attack were shared by the company, though. Further, the government on March 17 informed the Parliament that machine learning, AI, data analytics, data mining, enterprise resource planning (ERP) software, generative AI are some of the new technologies which will need trained manpower for modernization of India’s power distribution sector from a classical network to modern grid network. Certified linemen and solar technicians The government is also trying to certify and train the manpower who are working on contract basis in the power sector, starting from the linemen to supervisor in the fields of electrical safety, best operations and maintenance practices, information technology. Besides, the government has identified PM-Surya Ghar- Mufti Bijli Yojana as another area where skilled workforce is needed. While the target is train at least 3 lakh personnel across the value chain of setting up a rooftop solar power plant, of which 1 lakh are to solar technicians. Against the target of 3 lakh, the government has been able to train 66,434 personnel so far under the rooftop solar scheme. "
    },
    "https://www.moneycontrol.com/news/business/companies/room-acs-could-contribute-120-gw-to-india-s-peak-power-demand-by-2030-uc-berkeley-study-12976583.html": {
        "Headline": "Room ACs could contribute 120 GW to India's peak power demand by 2030: UC Berkeley study",
        "Description": "The report also calls for updating AC test procedures to better reflect India's humid climate, where comfort depends not just on cooling but on moisture removal.",
        "Content": "India is expected to add 130-150 million new room air conditioners (ACs) over the next decade, which could increase the country's peak power demand by more than 120 gigawatts (GW) by 2030 and 180 GW by 2035 if no policy intervention is made, according to a study published by the India Energy and Climate Center (IECC) at the University of California (UC) in Berkeley on March 26. India adds 10–15 million new ACs annually, with another 130–150 million expected over the next decade. The study said the fastest-developing major economy can avoid severe power shortages and save consumers up to Rs 2.2 lakh crore (USD 26 billion) by doubling the energy efficiency of room ACs over the next 10 years. \"ACs are becoming one of the biggest drivers of peak demand, and without intervention, we risk blackouts or costly emergency fixes. But with smart policy, we can turn this into a win for consumers, manufacturers and the grid,\" said Nikit Abhyankar, the study's lead author and UC Berkeley faculty. Moneycontrol reported on February 21 that India is likely to experience an 8 percent growth in peak electricity demand this summer with the country expected to experience more heat waves. Last year, the all-India peak electricity demand crossed 250 GW on May 30, which was 6.3 per cent higher than the projections. Climate change-induced heat stress is one of the key factors driving electricity demand. Also Read: Power Watch: Ahead of another sweltering summer, Centre preparing thermal plants for a record peak demand. The study by the University of California recommends updating India's Minimum Energy Performance Standards (MEPS), beginning with a 2027 revision that raises the 1-star label to ISEER 5.0 -- equivalent to today's 5-star level -- and tightening standards every three years. This alone could avoid 10 GW of shortages by 2028, 23 GW by 2030 and 60 GW by 2035, equivalent to 120 large power plants. Efficient ACs also offer massive consumer benefits. Even with slightly higher upfront prices, they could deliver net savings of Rs 66,000 to Rs 2,25,000 crore (USD 8–26 billion) by 2035, paying for themselves within two to three years through lower electricity bills. \"A common concern with efficient ACs is that they might be more expensive,\" said Amol Phadke, co-author and UC Berkeley faculty. \"But our analysis of global markets, including India, shows that efficiency is not the main factor driving retail prices. With the right policy support, higher efficiency often goes hand in hand with lower costs, thanks to economies of scale, better supply chains and competitive markets,\" he added. Also Read: Exclusive: Focusing on the ‘cooling’ sector will bring the biggest and fastest gains, says EESL chief. Over 600 AC models -- 20 per cent of all offerings -- already exceed India's top efficiency threshold, the 5-star level, with many produced by domestic manufacturers. The report also calls for updating AC test procedures to better reflect India's humid climate, where comfort depends not just on cooling but on moisture removal. \"This is a chance for Indian manufacturers to lead. With the right policy signal, they can scale under Make in India and PLI (Production Linked Incentive) schemes, positioning India as a global hub for sustainable and affordable cooling,\" said Jose Dominguez, co-author and IECC researcher. (With inputs from PTI) "
    },
    "https://www.moneycontrol.com/news/business/companies/bharti-airtel-prepays-additional-spectrum-dues-worth-nearly-rs-6-000-crore-redeems-1-billion-in-debt-12976417.html": {
        "Headline": "Bharti Airtel prepays additional spectrum dues worth nearly Rs 6,000 crore, redeems $1 billion in debt",
        "Description": "Airtel said it has now prepaid Rs 25,981 crore of high-cost spectrum liabilities for FY25, and cumulatively prepaid liabilities of Rs 66,665 crore as on date.",
        "Content": "Telecom major Bharti Airtel and subsidiary Bharti Hexacom have prepaid additional Rs 5,985 crore worth of high-cost debt for spectrum to the Department of Telecom, as well as voluntarily redeemed $1 billion worth of perpetual bonds issued be the company, according to an exchange filing on March 26. Airtel said it has now prepaid Rs 25,981 crore of high-cost spectrum liabilities for FY25, and cumulatively prepaid liabilities of Rs 66,665 crore as on date. The move by Airtel to lower its debt burden is seen as a step to improve the financial position, and lower the cost of its debt. \"Underscoring its commitment to financial prudence, operational efficiency, and its strong capital position, Airtel continues to prepay its high-cost spectrum liabilities, lowering its debt and cost of debt,\" the statement by Airtel said. The average interest rate on the cumulative liabilities prepaid was approximately 9.74%, Airtel said, and the prepayments have been made about 7 years ahead of their average residual maturities. The spectrum liabilities, tied to the 2024 auctions with an interest rate of 8.65%, were prepaid nearly seven years ahead of their average residual maturities, reducing Airtel's exposure to costlier debt. The prepayments have resulted in Airtel clearing Rs 1.16 lakh crore of scheduled payments, the telecom player added. Airtel has also lowered its cost of debt on the spectrum liabilities to an average of approximately 7.22% on the remaining Rs 52,000 crores of liabilities, excluding AGR dues. The residual spectrum liabilities now carry a long repayment profile, payable in annual instalments until FY42. Post the redemption of $1 billion in perpetual notes, Airtel will have nearly $479 million of perpetual bonds outstanding, issued in FY21, and slated to mature in FY26. Airtel has been stepping proactive measures to lower its cost of borrowing and prepay the spectrum dues over FY25. In September 2024, Airtel prepaid Rs 8,465 crore to the telecom department to clear deferred dues for spectrum acquired in 2016. It subsequently made a payment of Rs 3,626 crore to the Department of Telecom in December 2024, fully clearing its liabilities for the spectrum acquired during the 2016 auction. This twin-action is expected to strengthen Airtel’s balance sheet while it rolls out 5G and expands its coverage of rural 4G network. The telecom player has planned to direct greater capex for 5G expansion, and won't be spending additionally on 4G capacity expansion.  "
    },
    "https://www.moneycontrol.com/news/business/markets/zerodha-has-no-plans-to-go-public-and-does-not-require-additional-capital-nithin-kamath-12976358.html": {
        "Headline": "Zerodha has no plans to go public, does not require additional capital: Nithin Kamath",
        "Description": "Zerodha's Nithin Kamath said that there are no plans to list on exchanges, as the capital market disclosure requirements will be ‘hard’ to follow, and with the business is already highly-regulated, they do not want to subject themselves to further oversight.",
        "Content": "Online broker Zerodha has no plans to go public, as it doesn’t need funds and wants to avoid the additional scrutiny that comes with being a listed entity, co-founder and chief executive Nithin Kamath told CNBC-Awaaz on March 26. “We are already in a highly regulated industry, and we don’t want to subject ourselves to even more,” Kamath said in the interview. Kamath further said that the company has been offering Zerodha employees exits through ESOP buyback programmes every year, and they do not see the equity market offering a very high multiple to their existing valuation. “Possibly, 1-2 times the valuation, not five times,” Kamath said when asked if he would consider listing if the valuation multiples offered are higher. The brokerage has a philosophy, said Nithin Kamath, and capital market disclosure requirements will be ‘hard’ to follow in terms of quarterly targets, etc. “If regulators come and say we need to list, then we will have to,” added Kamath, but aside from that, he added there are no plans to list. The market growth of the past 10-15 years has been ‘fast-forwarded’, and since Covid, we have seen people explore capital markets as an avenue for deploying money, Kamath said. “The last 4-5 years have seen the biggest run in terms of participation.” F&O Activity Has Cooled Down Since October, the activity in the options market has been significantly down, Nithin Kamath said. “One has to assume that fewer trades will mean lesser losses as well.” In the futures segment, half of the clients are losing money, and the other half are making profits, said Kamath, but in options, both in terms of participation and market activity, the segment has cooled off. “Options are looking at a quick way of making money, and that’s not really possible in the market,” he added, explaining why so many investors lose money in teh options segment. Kamath said that the trend of the past six months would be a very short-term view, as the activity has been lower due to the bearish sentiment, especially in the cash segment, Kamath said. “We may be able to spot the trend in the F&O segment based on recent changes over the next year”, he said. “The retail activity is the mirror image of the market performance. As the last 4-5 years have been a bull run, the market activity too has picked up,” Kamath said. “This is the first time we have seen a ‘bear market of sorts,’ he added, when asked what the emerging trend could be over the next year. “Now that we have had a bounce back, if this continues, then definitely the activity will be back,” said Nithin Kamath. Post-Pandemic Bull Run The recent bull run after the pandemic has also seen a more diverse customer base at Zerodha. However, based on the log-in IPs of trading accounts with the brokerage, users seem more concentrated, though still more diverse when compared to 2016-17, Kamath added, when asked about the big changes he has seen in this rally. On increasing competition in the business, Zerodha said there everyone can potentially be disrupted in today's changing world, and the brokerage tries to maintain a differentiated outlook to stay ahead. \"As and when you get really big, you can't change as fast as we could, say as compared to 2015-16. That said, we keep updating products and offerings, and the uniqueness of our business is the philosophy with which we run. We have these nudges which dissuade people from trading, and I don't think there are many brokers who can take this stance.\" \"We do not spam, while our competitors send out 5-10 notifications on the mobile app, while we send once or twice a month. That is thinking philosophically differently about the business, as really long term. Whatever fits in the long term vision is what we will work on,\" Nithin Kamath added. "
    },
    "https://www.moneycontrol.com/news/india/less-than-1-of-health-claims-in-india-are-for-mental-health-report-reveals-12976131.html": {
        "Headline": "Less than 1% of health claims in India are for mental health, report reveals",
        "Description": "The finding was part of Marsh McLennan’s \"RiseUP for a Better Tomorrow\" Mental Health Report 2025",
        "Content": "Indian employees are grappling with a growing mental health crisis, yet fewer than 1% of health insurance claims in the country pertain to mental health, according to a new report by one of the world’s leading professional services firm Marsh McLennan. Despite a 2018 mandate by the Insurance Regulatory and Development Authority of India (IRDAI) requiring insurers to cover mental health treatments on par with physical health, gaps in coverage persist. Many policies exclude outpatient therapy, rehabilitation, and addiction treatment, leaving individuals with significant out-of-pocket costs, the report highlighted. The findings, released in Marsh McLennan’s \"RiseUP for a Better Tomorrow\" Mental Health Report 2025 in collaboration with Mpower, highlight key challenges in mental health insurance: The report found massive coverage gap - as 83% of organizations report minimal claims utilization, while 42% of individuals are unaware of or lack mental health coverage. Only 17% of insured individuals have access to therapy or counseling. Nearly half cite affordability as a major barrier. Around 48% said they fear discrimination, and 21% struggle to find in-network mental health providers. Addiction treatments and rehabilitation centers are largely excluded from insurance policies, creating further barriers to care. “The insurance industry has failed to provide adequate mental health coverage despite legislative support,” said Sanjay Kedia, CEO of Marsh McLennan India. “We need to establish a strong network of mental health providers, integrate outpatient treatments, and remove exclusions for conditions like substance use disorders and self-harm-related treatments.” The Parliament enacted landmark Mental Healthcare Act, 2017 further supported by IRADI, mandates every insurer to cover mental health treatment. Neerja Birla, founder of the Aditya Birla Education Trust, emphasized the urgency of insurance reforms, stating that mental health must be as accessible and affordable as physical health benefits. “Our healthcare and insurance systems must prioritize mental health,” Birla said. “Untreated mental health issues contribute to declining productivity, absenteeism, and long-term economic losses.” The report calls for comprehensive policy changes, including expanding coverage for therapy, teleconsultations, and rehabilitation services. It also urges insurers to remove exclusions for substance use disorders and self-harm while increasing public awareness to reduce stigma. Experts say integrating robust mental health coverage into insurance plans will help build a healthier workforce and contribute to a stronger Indian economy by 2047.  "
    },
    "https://www.moneycontrol.com/news/business/companies/vi-seeks-spectrum-surrender-to-reduce-rs-6-091-crore-bank-guarantee-burden-12975828.html": {
        "Headline": "Vi seeks spectrum surrender to reduce Rs 6,091-crore bank guarantee burden: Report",
        "Description": "The company, formed by the 2018 merger of Vodafone India and Idea Cellular, stated that this is its only pending securitisation requirement from the March 2015 auction",
        "Content": "Vodafone Idea (Vi) has requested the Department of Telecommunications (DoT) to allow it to surrender some spectrum acquired in auctions before 2021. This would lower its bank guarantee (BG) requirement for the March 2015 spectrum auction from Rs 6,091 crore to Rs 2,900 crore. Facing financial difficulties, Vi, in its March 10 letter to DoT secretary Neeraj Mittal, informed that it cannot provide a Rs 6,091-crore BG or pay Rs 5,493 crore in cash to cover the shortfall from the 2015 spectrum purchase,  according to a report by the Economic Times. CNBC Awaaz had first reported the development on March 24. The company stated that this is its only pending securitisation requirement from the March 2015 auction. The telecom major proposed alternative solutions, including offsetting the requirement against excess payments made in past auctions or utilizing existing BGs and cash deposits held by the DoT for regulatory compliance. The company pointed out that it had overpaid Rs 9,900 crore in the 2016 auction and Rs 8,800 crore in the 2012 and 2014 auctions. As per the report, Vi also noted that discussions with DoT on surrendering pre-2021 spectrum have been ongoing. Based on its proposal, the total spectrum obligation would decrease by Rs 4,800 crore, with Rs 3,200 crore of this reduction linked to the 2015 auction. Vi further highlighted that it had previously provided DoT with Rs 5,800 crore in BGs for regulatory matters and a Rs 2,450 crore cash deposit during an internal restructuring of Vodafone Group entities in December 2015. The company claimed that, in total, DoT holds Rs 26,950 crore in securitisation options, including past excess payments. It urged DoT to consider these options and refrain from any coercive action. Additionally, in a letter dated March 11, Vi CEO Akshaya Moondra requested DoT to expedite the conversion of the company’s outstanding regulatory dues—including adjusted gross revenue (AGR) and spectrum payments—into equity. These dues pertain to spectrum acquired in the 2012, 2014, 2015, and 2016 auctions. Vi will need to pay Rs 29,100 crore in March 2026. According to JM Financial estimates, annual regulatory payouts are expected to rise further from FY27, reaching approximately Rs 43,000 crore per year until FY31. As of the quarter ending December, Vi’s adjusted gross revenue (AGR) dues stood at Rs 70,000 crore, while its cash reserves were just Rs 12,090 crore. "
    },
    "https://www.moneycontrol.com/news/business/markets/api-maker-granules-pharma-simplifies-structure-involving-us-subsidiaries-12975565.html": {
        "Headline": "API maker Granules Pharma simplifies structure involving US subsidiaries",
        "Description": "The exercise is aimed at reducing legal entities and simplify operating structure, said Granules Pharma, and the plan is expected to reduce the number of legal entities, simplify operational structures, and create a unified holding structure. The management said the move will not result in any change in the ownership of the subsidiaries.",
        "Content": "API manufacturer Granules Pharma has announced a restructuring to simplify its organisational structure, resulting in its American unit Granules USA transferring assets to Granules Pharma Inc and merging with it, and another American division Granules Consumer Health (GCH) turning into a Limited Liability Company, the company informed on March 25. The exercise is aimed at reducing legal entities and simplify operating structure. \"The Plan is expected to reduce the number of legal entities, simplify the legal, tax, and operational structures, create a unified holding structure, and improve the market focus,\" said Granules Pharma. The management clarified that the move will not result in any change in the ownership of the subsidiaries, or the US business. Granules India will hold control of Granules Consumer Health (GCH) through Granules Pharma Inc. GCH is a division of Granules India that provides affordable, generic over-the-counter (OTC) products in America. The asset transfer will see Granules USA merge into Granules Pharma Inc, effectively consolidating the two entities into a single operational unit. Granules Pharma Inc, which is an FDA and DEA-approved facility and known for R&D and manufacturing capabilities gets strengthened as the primary operational hub in the US. The management also announced the appointment of PN Baskaran as President - Head API Manufacturing & Operations, effective April 2. Baskaran has a strong background in API and formulations, with over 30 years of experience in operations management, specializing in manufacturing and supply chain. Granules India's key segments include its product portfolio, which comprises of nearly two-third of the revenue for FY24, followed by the API business. The company has presence in more than 80 countries, with a predominant share of income from North America. The management has lined up a capex spend of around Rs 500 crore for FY26, with a focus on expanding production. The API player has been working to resolve issues raised by the USFDA at its Gagillapur facility in Hyderabad, which had received an official action indicated (OAI) classification, after getting six Form 483 observations following an inspection in September 2024. According to Granules India, it has completed 90% of the corrective and preventive actions (CAPA), and intends to close the remaining by March 2025. Read More: US FDA issues warning letter to Granules India's Gagillapur facility The transition of GCH into an LLC may involve regulatory approvals or financial implications, though the company has not specified any details in the announcement. "
    },
    "https://www.moneycontrol.com/news/business/companies/eli-lilly-s-weight-loss-drug-remains-expensive-for-most-indians-despite-local-pricing-12975513.html": {
        "Headline": "Eli Lilly’s weight loss drug remains expensive for most Indians despite local pricing",
        "Description": "Unlike the US, Europe or other developed markets, Mounjaro will have to be purchased out-of-pocket in India, as obesity is yet to be officially recognised as a disease here. This also keeps it out of reach for the average Indian.",
        "Content": "Eli Lilly's weight loss drug Mounjaro, launched last week in India at a significantly lower price than in the US, may still be out of reach for most Indian patients, doctors treating obesity told Moneycontrol. Mounjaro is expected to be a premium-priced medication, said Dr Hemant Patel, Bariatric Surgery & Consulting General Laparoscopic Surgeon, Zynova Shalby Multispecialty Hospital. \"While it offers numerous health benefits like weight loss, controlled blood sugar levels, and a lower risk of obesity-related diseases, the cost may be a major concern for many when it comes to long-term use,\" Patel said. Mounjaro is priced at Rs 3,500 for a 2.5 mg vial and Rs 4,375 for a 5 mg vial. The lowest dose of Mounjaro can cost you around Rs 14,000 per month, adding up to Rs 168,000 per year. The list price in the US is around $1,086.37 per month, but the actual costs can vary significantly depending on insurance coverage. An Eli Lilly spokesperson told Moneycontrol that price comparisons between countries can be \"misleading due to the significant variations in healthcare systems, economies and reimbursement policies in each country\". The treatment with Mounjaro may require long-term doses to effectively manage diabetes and weight loss. Out-of-pocket expenditure Unlike the US, Europe or other developed markets, Mounjaro will have to be purchased out-of-pocket in India, as obesity is yet to be officially recognised as a disease here. This also keeps it out of reach for the average Indian. \"Abroad, drugs like Mounjaro are covered by insurance policies. In India, because our spend (on healthcare) is 1 percent to 1.5 percent of our total GDP, now if we include some of these drugs, which are expensive, it will be a real challenge for us, as we have a huge number of type 2 diabetics. And 80 percent of our type 2 diabetics are overweight or obese,\" said Dr Muffazal Lakdawala, one of India's leading bariatric and minimal access surgeons. \"So if you start saying this is a disease and you start prescribing it for obesity alone, think of the number of people that Indian insurance companies will have to pay for. So that remains a challenge.\" Lakdawala added. Despite the cost challenges, doctors say combining Mounjaro with a healthy, well-balanced diet and exercise can help control type 2 diabetes and reduce weight. Mounjaro is a once-a-week injectable medication that is prescribed for type 2 diabetes and weight loss. The treatment usually starts with a low dose. Over time, doctors may gradually increase the dosage based on the patient’s response. The doctors may monitor the patient's progress and adjust the dose accordingly. The number of doses one may need can vary from person to person. Patients are now waiting for Novo Nordisk's Ozempic, whose launch timeline is not yet announced. The US list price for a monthly package of Ozempic is priced slightly lower than Mounjaro at $935.77 per month. Generic versions of Ozempic are expected in 2026, which is expected to bring the prices of weight loss drugs within the affordable range of most Indians.  "
    },
    "https://www.moneycontrol.com/news/business/companies/ongc-india-s-top-oil-and-gas-explorer-prepares-for-a-looming-glut-12975154.html": {
        "Headline": "ONGC, India’s top oil and gas explorer, prepares for a looming glut",
        "Description": "According to the International Energy Agency, the world is entering an era of cheaper energy prices, with growing electricity use leading to a surplus of oil and gas.",
        "Content": "India’s largest explorer Oil and Natural Gas Corp. is seeking to diversify its portfolio to shield its core business from volatile oil prices, said Arunangshu Sarkar, director for strategy at the state-run giant. The company’s multi-pronged approach involves entering the refining and petrochemical sectors, trading liquefied natural gas and growing its renewable capacity. According to the International Energy Agency, the world is entering an era of cheaper energy prices, with growing electricity use leading to a surplus of oil and gas. ONGC is among the several oil majors looking to diversify their business strategies as the global economy moves away from fossil fuels. “Globally, we are heading to a glut in oil supplies which means prices will reduce,” Sarkar said in an interview. “It will be difficult for a company like ONGC to survive in a low oil-price regime and the new businesses provide a hedge for such a scenario.” While crude prices decline, production costs for the explorer are on the rise, with easily available oil already extracted and depleted fields yielding little fuel, further squeezing profits. Sarkar, a petroleum engineer, took charge as ONGC’s first director for strategy in September. The New Delhi-based company is seeking to book 3 million tons a year of regassification capacity on the country’s western coast and is already discussing long-term offtake deals with city gas retailers, Sarkar said. Since benchmark indices are linked to crude, importing cheap gas to be sold in India can help offset lower profits due to oil volatility, he added. ONGC is also planning to build its first refinery, with a focus on oil-to-chemicals, Sarkar said, declining to give more details as the plan is still at a nascent stage. At a group level, ONGC already has a refining capacity of 1 million barrels a day, or a fifth of India’s total, through its units Hindustan Petroleum Corp Ltd. and Mangalore Refinery and Petrochemicals Ltd. Refiners are increasingly turning to petrochemicals as the spread of electric vehicles is projected to dent demand growth for diesel and gasoline. The third pillar of diversification is clean energy. The company has set a target to reach 10 gigawatts of renewable capacity by 2030, about three times more than now. It will soon be seeking bids to build 1 gigawatt of solar and wind power capacity for its captive use, Sarkar added. "
    },
    "https://www.moneycontrol.com/news/business/companies/sbi-raises-1-billion-in-one-of-the-largest-bank-loan-of-2025-12975134.html": {
        "Headline": "SBI raises $1 billion in one of the largest bank loan of 2025",
        "Description": "Foreign-currency loans taken out by Indian issuers have declined 30% to $3.2 billion so far in 2025 from the year-earlier period, and are running at a four-year low.",
        "Content": "State Bank of India raised $1 billion in the largest dollar-denominated syndicated loan this year from the nation, giving a boost to the lagging foreign-currency debt market. The borrower opted not to exercise a greenshoe option to increase the five-year facility by as much as $250 million, said people familiar with the matter, who asked not to be identified discussing private information. SBI declined to comment. Foreign-currency loans taken out by Indian issuers have declined 30% to $3.2 billion so far in 2025 from the year-earlier period, and are running at a four-year low, according to Bloomberg-compiled data. But that trend could soon reverse, with billionaire Mukesh Ambani’s conglomerate Reliance Industries Ltd. currently in the market for a loan of as much as $3 billion. Non-banking finance companies, or so-called shadow banks, in particular, are increasingly tapping the dollar-denominated facilities amid stricter regulations onshore. Shriram Finance Ltd., India’s biggest truck financier, is in talks with banks to raise as much as $250 million via a three-year loan, which would add to its record $2 billion of offshore borrowings raised in the current financial year ending March 31. Bank of Baroda also obtained a $750 million term facility from eight lenders earlier this month. "
    },
    "https://www.moneycontrol.com/news/business/companies/power-watch-ahead-of-another-sweltering-summer-centre-preparing-thermal-plants-for-a-record-peak-demand-12974979.html": {
        "Headline": "Power Watch: Ahead of another sweltering summer, Centre preparing thermal plants for a record peak demand",
        "Description": "Coal stocks at domestic thermal power plants (TPPs) – a key indicator proportionate to India’s potential to generate electricity - is currently at a historic high of 54 million tonne (MT), according to Power Ministry.",
        "Content": "With day temperatures across India set to rise by 2-5 degrees Celsius over the next three to four days, coal-fired power plants will be key to meet the summer demand, which may surpass the 2024 high to hit 270 gigawatts (GW), the Ministry of Power has said. The country is bracing for a hotter-than-usual summer this season, with the India Meteorological Department (IMD) predicting above-normal temperatures and more heatwave days, particularly in North India. In light of the forecast, Centre has increased its projected peak power demand by 20 GW from the high of 250 GW seen on May 30 last year. The month of May would be ‘the most critical’ this year as well, according to Grid India, which is preparing to guard against heightened system vulnerabilities triggered by peak demands and variation in renewable power generation. Even though renewable energy now accounts for 46 percent of India’s total electricity capacity, coal would remain the mainstay in meeting this peak load. “We are expecting thermal (coal-fired) power to account for 70-74 percent in meeting the country’s peak demand this year. The share of renewable energy, which usually accounts for 11-14 percent will increase marginally by 2-3 percent. The contribution of hydropower is going to remain the same ranging from 7-11 percent,” Central Electricity Authority (CEA) chairperson Ghanshyam Prasad told Moneycontrol. CEA, a statutory body under the Ministry of Power, is responsible for technical coordination and supervision of the power sector. Record High Coal Stocks Coal stocks at domestic thermal power plants (TPPs) – a key indicator proportionate to India’s potential to generate electricity - is currently at a historic high of 54 million tonne (MT), according to Power Ministry data. Of the total 172 domestic, coal-based thermal power plants in India, only 12 had critical stocks as on March 24, which is considered to be a manageable situation. Coal stock is said to be at a critical level when power plants have less than 25 percent of the normative 26 days’ worth of fuel supply with them. Coal stocks at TPPs have been under the spotlight after an episode of crisis that occurred over three years ago. In October 2021, India faced a severe, three-month long coal shortage, leading to power cuts and disruptions, as thermal power plants struggled to maintain adequate stock. Since then, the ministries of power, coal and railways have constituted a sub-group that meets twice a week to coordinate on coal production and logistics for power generation. “For FY26, the Power Ministry has communicated their demand with us which is 906 MT. Accordingly, we will be distributing it (target) amongst our three major coal-producing sources - Coal India, captive and commercial mines and Singareni Collieries Company. The stated demand will be met by the Coal Ministry,” said a senior official from the Ministry of Coal. India has produced a record one billion tonne of coal so far during FY25, compared to last fiscal's 997.83 million tonne (MT). Rising Night-time Demand The nation has been seeing an increasing peak power demand during the night or evening periods, considered as non-solar hours, and this remains a concern for the government. The trend emerged in 2023, when the peak demand almost neared the day time demand, with all the load falling on coal-fired power generation. “During the day, we have more than enough power available since solar generation helps meet at least 50,000 MW (50 GW) of power demand, or even more. So, meeting the peak demand is not an issue. The problem is that the night-time peak demand is also touching almost similar levels since the summer of 2023,” said a senior ministry official. During night time, electricity from solar power is zero, which puts all the load on thermal power capacity. In order to meet the night time demand, Centre has now started relying on 10-12 GW of gas-based power as well. Section 11 to be Imposed if Necessary Power Secretary Pankaj Agarwal said that the government is not ruling out imposing Section 11 of the Electricity Act, 2003 for imported coal and gas-based power plants to mandatorily run on full-capacity during the crunch, if the situation demands. “As of now we have not ordered it. But if there is any crunch projected in meeting the peak demand, we would impose if the situation demands,” he said. The Centre is also unlikely to make it mandatory for thermal power plants to blend imported coal for electricity generation this summer, when demand tends to spike, unlike the previous few years. "
    },
    "https://www.moneycontrol.com/technology/india-slaps-samsung-with-tax-demand-of-601-million-for-telecom-imports-article-12975002.html": {
        "Headline": "India slaps Samsung with tax demand of $601 million for telecom imports",
        "Description": "The demand represents a substantial chunk of last year's net profit of $955 million for Samsung in India",
        "Content": "India has ordered Samsung and its executives in the country to pay $601 million in back taxes and penalties for dodging tariffs on import of key telecoms equipment, a government order showed, for one of the biggest such demands in recent years. The demand represents a substantial chunk of last year's net profit of $955 million for Samsung in India, where it is one of the largest players in the consumer electronics and smartphones market. It can be challenged in a tax tribunal or the courts. The company, which also imports telecoms equipment through its network division, received a warning in 2023 for misclassifying imports to evade tariffs of 10% or 20% on a critical transmission component used in mobile towers. It imported and sold these items to billionaire Mukesh Ambani's telecom giant, Reliance Jio. Samsung pushed India's tax authority to drop the scrutiny, saying the component did not attract tariffs and officials had known its classification practice for years. But customs authorities disagreed in a confidential January 8 order that is not public but was reviewed by Reuters. Samsung \"violated\" Indian laws and \"knowingly and intentionally presented false documents before the customs authority for clearance\", Sonal Bajaj, a commissioner of customs, said in the order. Investigators found that Samsung \"transgressed all business ethics and industry practices or standards in order to achieve their sole motive of maximising their profit by defrauding the government exchequer,\" Bajaj added. Samsung was ordered to pay 44.6 billion rupees ($520 million), consisting of unpaid taxes and a penalty of 100%. Seven India executives face fines of $81 million, among them the network division's vice president, Sung Beam Hong, Chief Financial Officer Dong Won Chu and Sheetal Jain, a general manager for finance, as well as Nikhil Aggarwal, Samsung's general manager for indirect taxes, the order showed. \"The issue involves the interpretation of classification of goods by customs,\" Samsung said in a statement, adding that it complied with Indian laws. \"We are assessing legal options to ensure our rights are fully protected.\" India's customs authority and the finance ministry did not respond to Reuters' queries. Reliance also did not respond. The incident comes as India toughens oversight of foreign companies and their imports. Volkswagen and New Delhi are locked in a legal battle in which the automaker is challenging a record demand of $1.4 billion in import back taxes on grounds of misclassifying car parts. The German company denies any wrongdoing in what it called a \"matter of life and death\" for its India business, but the dispute has rekindled foreign investors' fears over tax tussles. 'REMOTE RADIO HEAD' The Samsung investigation began in 2021 when tax inspectors searched its offices in the financial capital of Mumbai and Gurugram near New Delhi, seizing documents, emails and some electronic devices. Top executives were later questioned. The Samsung dispute centers on imports of the \"Remote Radio Head\", a radio-frequency circuit enclosed in a small outdoor module that tax officials called \"one of the most important\" parts of 4G telecoms systems. From 2018 to 2021, Indian officials found, Samsung paid no dues on imports worth $784 million of the component from Korea and Vietnam. The component fitted on telecoms towers transmits signals and is subject to a tariff, the government said, though Samsung disagreed on how it functions. Samsung vehemently defended its classification, backed its case with four expert opinions, saying the component did not perform the functions of a transceiver and could be imported without any duty, the tax order said. As counter evidence, tax officials cited 2020 letters from Samsung to the Indian government describing the component as a transceiver, which the government said is \"a device which transmits\" signals. Samsung \"was very much aware about the right classification of the impugned goods,\" the tax commissioner added. "
    },
    "https://www.moneycontrol.com/news/business/companies/centre-not-keen-on-conversion-of-vodafone-idea-s-debt-into-further-equity-report-12974799.html": {
        "Headline": "Centre not keen on conversion of Vodafone Idea's debt into further equity: Report",
        "Description": "Government wants the company to raise funds on its own and will resort to debt conversion only if is left with no other choice",
        "Content": "The Union government will review if it needs to further convert its dues owed into equity in Vodafone Idea, a report by Business Standard said on March 25, adding that the step will be taken only if there is no other option. The Central government is not interested in raising its equity in the telecom firm and wants it to raise capital on its own, the newspaper reported. The company’s chief executive officer Akshaya Moondra has since early 2024 said that the relief package allows it to convert its dues owed to the government into equity, BS reported. However, the telecommunications department said that the company was also expected to raise capital from strategic sources on priority, according to BS. On March 24, Times of India reported that the government is set to waive off spectrum usage charges, providing major relief to telcom operators including Vodafone Idea, Bharti Airtel and Reliance Jio. The exemption could provide a boost of several thousand crores of rupees and in turn help in the expansion of their networks and 5G services, the TOI report added. Last week, Vodafone Idea rolled out its 5G services in the country, starting from the country's financial capital Mumbai. Further, Vi said it plans to invest Rs 50,000-55,000 crore over the next three years to expand its 4G network coverage to 90 percent of the country while rolling out 5G services in key geographies. Disclosure: Moneycontrol is a part of the Network18 group. Network18 is controlled by Independent Media Trust, of which Reliance Industries is the sole beneficiary. "
    },
    "https://www.moneycontrol.com/news/business/markets/external-auditor-pwc-may-submit-report-on-indusind-bank-s-accounting-discrepancies-on-friday-12974824.html": {
        "Headline": "External auditor PwC may submit report on IndusInd Bank's accounting discrepancies on March 28",
        "Description": "The comprehensive report by PwC is expected to point out actual loss to the bank due to accounting discrepancies, lapses at various levels and remedial action, sources said",
        "Content": "IndusInd Bank's external auditor PwC is set to submit its report related to the accounting lapses in the derivative portfolio to the lender's board on Friday, PTI reported citing sources. According to an estimate, a discrepancy of Rs 2,100 crore in accounting may impact 2.35 percent of the bank's net worth. The auditor's report is expected to point out actual loss to the bank due to accounting discrepancies, lapses at various levels and remedial action, the report said. Banking sector regulator, Reserve Bank had directed the board and the management of IndusInd Bank to take remedial action during the current quarter itself after making required disclosures to all stakeholders. The current quarter comes to an end on March 31. Meanwhile, the IndusInd Bank's board has also hired Grant Thornton to conduct a forensic audit into accounting lapses. As per the mandate, Grant Thornton would conduct a comprehensive investigation to identify the root cause of the discrepancies and assess the correctness and impact of the accounting treatment of the derivative contracts with regard to the prevailing accounting standards. Additionally, the firm would identify any lapses and establish accountability with regard to discrepancies in accounting. The bank on March 10, had disclosed certain discrepancies identified by the lender in its account balances relating to its derivatives portfolio. Soon after the bank's disclosure, global rating agency Moody's placed the IndusInd Bank's baseline credit assessment (BCA) under review for a possible downgrade following the disclosure. Moody's placed IndusInd's Ba1 Baseline Credit Assessment (BCA) and adjusted BCA under review for downgrade. Baseline credit assessments are based on the entity's standalone financial health, without considering any support it might get from related companies. Last week, IIHL chairman Ashok Hinduja said IndusInd Bank has not sought any fresh capital from its promoters even though it suffered a huge loss in its net worth following an accounting discrepancy. IIHL, the investment arm of Hinduja Group, has recently got RBI's in-principle approval to raise its stake in IndusInd Bank from 16 per cent to 26 per cent. According to Hinduja, IndusInd International Holdings Ltd (IIHL) — the Mauritius-based promoters of the private sector lender — has committed to infuse capital into the bank in case there is a requirement. With PTI inputs "
    },
    "https://www.moneycontrol.com/news/telecom/vodafone-idea-opts-for-split-it-deal-with-ibm-kyndryl-at-a-discounted-rate-to-cut-costs-12974767.html": {
        "Headline": "Vodafone Idea opts for split IT deal with IBM, Kyndryl at a discounted rate to cut costs",
        "Description": "The new agreement comes at a significantly lower value than the previous $800 million deal with IBM, which ended in April 2024. The move is an effort by the cash-strapped firm to cuts costs",
        "Content": "Vodafone Idea has awarded IBM and Kyndryl a multi-year, bifurcated IT outsourcing deal after renegotiating the terms, chief technology officer Jagbir Singh has told Moneycontrol. Singh didn’t share the deal size but sources put its combined value between $500 million and $600 million. The new agreement comes at a significantly lower value than the previous $800 million deal with IBM, which ended in April 2024.  The move is an effort by the cash-strapped telecom to cuts costs. “Instead of providing the contract to one vendor, we have gone with whoever is the expert in the space,” Singh said. The latest deal significantly reduces reliance on IBM, as the US tech giant will now handle only key areas such as application development and management, he said. Kyndryl, which, too, is US-based, has been awarded key processes related to managed infrastructure, including maintaining servers, storage, and firewalls. Vodafone Idea has also awarded contracts to other smaller vendors to ensure vendor diversity. Cutting costs, going in-house The telecom company has chosen to involve more vendors to reduce overall operating costs and work with specialised firms in specific areas rather than renewing the entire agreement with IBM alone, he said. The goal of bringing in new vendors is to engage specialised providers who can deliver better results at lower costs— a strategy it has also employed to secure the best deals for its 4G and 5G network contracts. The moves are slated to unlock cost and operational efficiencies and boost Vi's productivity, Singh said. This cost reduction aligns with Vodafone Idea’s ongoing financial challenges as it seeks government support to manage its AGR and spectrum dues. “For the infrastructure part, like maintaining servers, storage, and firewalls, we have given that part to Kyndrl and the applications part to IBM,” Singh said. “Separately, we have awarded the testing part to another vendor. Instead of providing the contract to one vendor, we have gone with whoever is the expert in the space.” The telecom operator has brought digital development and network-managed services in-house to leverage talent and save capex and opex. To further cut operating expenditure (OPEX), the company has taken many processes in house. “We have given a lot of house-on-in-house expertise to the company. So, all are my responsibilities, whether IT, network, or digital. For digital, most of the development is in-house. Besides, managed services for the network are being taken care of in-house,” Singh said. The Vodafone Idea's in-house network and IT team is also focused on automation. The firm is also training its employees on cloud, IP/MPLS, AI tools, and machine learning. “While we haven't increased the manpower or laid off employees, we have increased the scope of the manpower employed by doing automation…we are saving money on the network integration part by doing it ourselves,” Singh said. The IT outsourcing deals are critical for Vodafone Idea, which aims to enhance its infrastructure to support its expanding 4G network and prepare for the planned 5G rollout in the top 100 cities within its 17 priority markets. The tech outsourcing deal's renewal follows a mega $3.6-billion deal with Nokia, Ericsson and Samsung to secure 4G and 5G network equipment over three years. The network and IT outsourcing deals are part of the company’s three-year capex plan of $6.6 billion, which is directed towards expanding the 4G population coverage from 1.03 billion to 1.2 billion, launching 5G in critical markets and expanding capacity in line with data growth. "
    },
    "https://www.moneycontrol.com/news/business/companies/delhi-high-court-denies-injunction-on-roche-s-rare-genetic-disease-medication-12974607.html": {
        "Headline": "Delhi HC denies stay against Natco Pharma, potentially paving way for affordable generic drug",
        "Description": "The high court decision potentially opens the door for access to a generic version of the patented drug - Risdiplam - at a fraction of the cost marketed by the Swiss pharmaceutical major.",
        "Content": "The Delhi High Court has denied an injunction request from Swiss pharma major La Hoffman Roche on March 25, in an alleged patent infringement case against Natco Pharma, potentially opening the door for access to a generic of the patented drug Risdiplam at a fraction of the marketed cost. An injunction is an order issued by a court, to a party, requiring them to either perform or abstain from a specific act. Roche had moved the court seeking interim injunction for restraining the infringement of the Suit Patent No. IN 334397, arguing that it has a term of 20 years from May 2015 till May 2035. It said there has been no pre-grant or post-grant opposition, or any revocation proceedings filed against the suit patent in India. Roche counsel argued that the plaintiffs have voluntarily provided a heavy price reduction anddiscounts to the Government of India for the cause of patients of SMA - a genetic condition - in India. Seba PA and Purva Mittal, two young women battling SMA, had intervened in the case to highlight the urgent need for the court to consider their right to life in the matter, as well as the significant negative impact an injunction could have on access to the drug Risdiplam, given the price disparity between patented drug and its anticipated, low-cost generic. SMA is a genetic condition that causes muscle weakness and atrophy, due to damage to nerve cells in the spinal cord, leading to difficulty with basic functions like walking, breathing, and swallowing. Roche, through its Patient Support Program (PSP) is offering Evrysdi (Risdiplam), for Rs 72 lakh annually for the first two years and Rs 56 lakhs annually for the third year. Patients and their families are demanding immediate action to ensure that scientific advancements and life-saving medications for rare diseases become accessible to all. Since early 2021, courts have been addressing petitions related to SMA, advocating for local production and generic competition to address the high cost of treatments driven by patent monopolies. One of the patients and the petitioner, Seba said, \"I believe that the court's decision will provide relief to SMA patients in our country. I welcome this decision and urge Natco Pharma to supply the generic drug without delay, at a price accessible to patients.\" “While effective therapies such as Risdiplam have been proven to save lives and improve quality of life, their prohibitive costs have kept them out of reach for many patients. We hope this judgement will pave the way for affordable access for SMA patients,\" Purva Mittal, who has been living with SMA, said. While the Indian government has increased funding for rare disease patients under the National Policy for Rare Diseases, providing up to Rs 50 lakh per patient, this amount remains insufficient due to Roche’s exorbitant monopoly pricing, creating significant barriers to continued therapy, as the government is unwilling to raise the funding limit. For Seba’s treatment, the Center of Excellence (CoE) for rare disease treatment procured 24 bottles ofRisdiplam at Rs 2,03,840 per bottle. With an annual requirement of 30 bottles, the total yearly costof her treatment reaches Rs. 61,15,200—far exceeding the Rs 50 lakh limit. As a result, her drug supply ended on 15 February 2025, causing a dangerous interruption in treatment and leaving her in fear of hospitalization. Seba’s lawyer, Anand Grover, welcomed the Delhi High Court’s ruling, emphasizing that it willprevent many unnecessary SMA-related deaths. He added that in pharmaceutical patent enforcement cases, public health considerations must take precedence. Rajeswari Hariharan, who appeared for Purva Mittal, hailed the judgement and said that the reasoning of the court will go a long way in facilitating affordable access to medicines for rare diseases. Evidence shows that generic competition can lower drug prices significantly. Risdiplam, being a small molecule drug, is less complex to manufacture, making affordable generic production and supply immediately feasible. "
    }
}